#### ScheduleHeadingOrientation Enumeration

---

|  |
| --- |
| See Also |

Orientation of schedule heading.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum ScheduleHeadingOrientation ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ScheduleHeadingOrientation ``` |

| Visual C++ |
| --- |
| ``` public enum class ScheduleHeadingOrientation ``` |

# Members

| Member name | Description |
| --- | --- |
| Horizontal | Horizontal |
| Vertical | Vertical |

# See Also

Autodesk.Revit.DB Namespace